{
  "title": "Darryl Anka | Channeling Bashar, Parallel Realities, Extraterrestrial Entities, Metaphysical World",
  "description": "Darryl Anka and Danica Patrick - Are there humans on other planets? Are We Genetically Related To Aliens? Are the Royals Reptilians? All these questions and more! ( MUST SEE INTERVIEW )\n\nEpisode Partner:  https://www.drinkAG1.com/PRETTYINTENSE\nCheck Danica's brands: https://www.voyantbydanica.com/ https://www.somniumwine.com/  https://danicarosewine.com/\n\nOther Videos you would like:\nRobert Edward Grant | PRETTY INTENSE PODCAST\nhttps://youtu.be/eUbP056Wjkk\nBrian Cox | FULL VIDEO PODCAST\nhttps://youtu.be/cdAgK31r02E\nDr. Steven Greer | FULL VIDEO PODCAST\nhttps://youtu.be/EhIITMb5pZk\n\nEPISODE NOTES:\nWelcome back to The Pretty Intense Podcast. Our guest today is Darryl Anka. Darryl is a writer, directer, producer, and a channeler. Darryl channels Bashar, a physical ET, and a friend from the future. Bashar is here to bring us information. He is trying to help us. Bashar shares galactic information, explaining how this all works, and the rules to the game. This is the information I am always after. What are the rules to this game so that I know how to play it? I got the answer today people, you have to listen. Bashar can see that map of how this all works on this planet, as easily as seeing colors. We talk about his 5 step play book, of how to live this life. I am always wondering how we are going to best navigate, from where we are at on this planet at this time, to a way out. How are we going to find ourselves living in more harmony. How do we escape this mess? I loved talking to Darryl, and I hope you really enjoy listening. \n\n========\n\n00:00 - Intro\n04:00 - Experience Of Physical Reality\n10:00 - Jumping Time Frames\n13:00 - Steps To Take Towards Alignment\n20:00 - Bashar's Earth Predictions\n24:00 - What Does Death Feel Like\n30:00 - Mutated Humans\n35:00 - The Arc Of The Covenant\n40:00 - Did We Go To The Moon\n46:00 - Atlantean Technology\n50:00 - Manifesting\n55:00 - 6th Hybrid Race\n1:00:00 - Sentient AI\n\n========\n\nBIO:\nDarryl has given seminars around the world for 40 years on the subject of\rmetaphysics via Bashar Communications, Inc. which is owned and operated\rby April Rochelle. Over 20 books, based on his seminars, have been\rpublished in the United States and Japan, with more books on the way.\rRecordings and additional information can be found at www.bashar.org.\rIn addition to his speaking career, Darryl has over 35 years of experience in\rminiature effects, storyboards, sets and designs on three Star Trek films, Iron\rMan, The Aviator, Pirates of the Caribbean 3: At World's End, I Robot, Live\rFree or Die Hard, and Flags of our Fathers among several others.\rDarryl has made three films as writer-director-producer. The first, called\r\"Dearly Departed,\" is a fictional documentary shot as if the crew took a\rcamera into the afterlife and interviewed the spirits of people who've passed\ron to get their insights on life after death.\rThe second film, a unique documentary called “First Contact,” explores\rhow channeling works and the potential impact of ET contact on our society.\rThe third film, “Alienated” is a sci-fi romance distributed internationally by\rIndie Rights Movies on Amazon, Vimeo, and Tubi TV among other platforms.\rIn addition to writing scripts, Darryl has written two published sci-fi novels\rin an ongoing series called “Shards of a Shattered Mirror,” available at\rdarrylanka.com.\rDarryl is presently running Boggled Escape Rooms and developing a\rnumber of other entertainment projects along with his wife and co-producer,\r Erica Jordan.",
  "uploader": "Danica Patrick",
  "duration": 4034,
  "view_count": 362711,
  "like_count": 14263,
  "upload_date": "2024-03-07",
  "processed_date": "2025-03-08T14:13:14.312293",
  "video_id": "qCtvgJG1I5A",
  "original_url": "https://youtube.com/watch?v=qCtvgJG1I5A&si=jN0M8G_VKzeXbzRZ",
  "output_filename": "Danica_Patrick-2024-03-07-Darryl_Anka___Channeling_Bashar,_Parallel_Realities,_Extraterrestrial_Entities,_Metaphysical_World"
}