{
  "url": "https://www.instagram.com/reel/DHY_a9eunHh/?igsh=NDRvYnZraWx5MTlt",
  "content_id": "DHY_a9eunHh",
  "platform": "instagram",
  "title": "Lisa-Marie Del Rio, Psy.D. on Instagram: \"Men are socialized to experience anger and neutrality as acceptable, but emotions, like fear or sadness are discouraged, because they showcase vulnerability and potential weakness.\n\nThis is a unique curse against men, because according to their neurological makeup, they experience these very primal, very vulnerable, very negative emotions more readily than women. \n\nThese sensations are necessary for our survival and the men that are able to recognize, honor, and hold their fear are the true protectors of our world. \n\nAlthough their strength is important as long as predators exist in the world, we want to make space to recognize their emotional tenderness, too, and the unique weight that they carry for us. \n\nThis is the “other half” to the reel I recently created for rage as sacred for women. I do things in pairs for both women and men so that everyone feels seen and so that we can reunite. I didn’t forget about my male followers. It just takes me a little longer to create content for men since I am not a man, and I have to ascend the limitations of my gender to feel what they feel. \n\nThank you for your patience, and I hope you feel seen today. \n\nMen and women share this world with each other, and our working relationship is the future we are all praying for. \n\nFrom my heart, LM\"",
  "processed_files": {
    "success": true,
    "video": "/home/walub/Documents/Processed-ContentIdeas/dr.lisamarie.delrio-2025-03-19-Men are socialized to experience anger and neutrality as acceptable, but emotions, like fear or sadn.mp4",
    "transcript": "/home/walub/Documents/Processed-ContentIdeas/dr.lisamarie.delrio-2025-03-19-Men are socialized to experience anger and neutrality as acceptable, but emotions, like fear or sadn.md",
    "images": [
      "/home/walub/Documents/Processed-ContentIdeas/dr.lisamarie.delrio-2025-03-19-Men are socialized to experience anger and neutrality as acceptable, but emotions, like fear or sadn-0.jpg"
    ],
    "thumbnail": "/home/walub/Documents/Processed-ContentIdeas/dr.lisamarie.delrio-2025-03-19-Men are socialized to experience anger and neutrality as acceptable, but emotions, like fear or sadn.jpg",
    "metadata": "/home/walub/Documents/Processed-ContentIdeas/dr.lisamarie.delrio-2025-03-19-Men are socialized to experience anger and neutrality as acceptable, but emotions, like fear or sadn.json",
    "username": "dr.lisamarie.delrio"
  },
  "processed_at": "2025-03-25T16:25:20.199106"
}